
//定义 城市 数据数组
cityArray = [];
cityArray[0] = ["-全国-","-不限-"];
cityArray[1] = ["北京",
    "东城区|西城区|朝阳区|丰台区|石景山区|门头沟区|房山区|通州区|顺义区|昌平区|大兴区|平谷区|怀柔区|密云区|延庆区"];
cityArray[2] = ["上海",
    "黄浦区|卢湾区|徐汇区|长宁区|静安区|普陀区|闸北区|虹口区|杨浦区|闵行区|宝山区|嘉定区|浦东新区|金山区|松江区|青浦区|奉贤区|崇明县"];
cityArray[3] = ["天津",
    "和平区|东丽区|河东区|西青区|河西区|津南区|南开区|北辰区|河北区|武清区|红桥区|宁河区|静海区|宝坻区|蓟县|滨海新区"];
cityArray[4] = ["重庆",
    "渝中区|大渡口区|江北区|沙坪坝区|九龙坡区|南岸区|北碚区|渝北区|巴南区|涪陵区|綦江区|大足区|长寿区|江津区|合川区|永川区|南川区|璧山区|铜梁区|潼南区|荣昌区|万州区|梁平县|城口县|丰都县|垫江县|忠县|开县|云阳县|奉节县|巫山县|巫溪县|黔江区|武隆县|石柱土家族自治县|秀山土家族苗族自治县|酉阳土家族苗族自治县|彭水苗族土家族自治县"];
cityArray[5] = ["河北", "石家庄|邯郸|邢台|保定|张家口|承德|廊坊|唐山|秦皇岛|沧州|衡水"];
cityArray[6] = ["山西", "太原|大同|阳泉|长治|晋城|朔州|吕梁|忻州|晋中|临汾|运城"];
cityArray[7] = ["内蒙古",
    "呼和浩特|包头|乌海|赤峰|通辽|鄂尔多斯|呼伦贝尔|巴彦淖尔|乌兰察布|兴安盟|锡林郭勒盟|阿拉善盟"];
cityArray[8] = ["辽宁", "沈阳|大连|鞍山|抚顺|本溪|丹东|锦州|营口|阜新|辽阳|盘锦|铁岭|朝阳|葫芦岛"];
cityArray[9] = ["吉林", "长春|吉林|四平|辽源|通化|白山|松原|白城|延边朝鲜族自治州|长白山保护开发区|梅河口|公主岭"];
cityArray[10] = ["黑龙江",
    "哈尔滨|齐齐哈尔|牡丹江|佳木斯|大庆|绥化|鹤岗|鸡西|黑河|双鸭山|伊春|七台河|大兴安岭地区"];
cityArray[11] = ["江苏", "南京|镇江|苏州|南通|扬州|盐城|徐州|连云港|常州|无锡|宿迁|泰州|淮安"];
cityArray[12] = ["浙江", "杭州|宁波|温州|嘉兴|湖州|绍兴|金华|衢州|舟山|台州|丽水"];
cityArray[13] = ["安徽", "合肥|芜湖|蚌埠|淮南|马鞍山|淮北|铜陵|安庆|黄山|滁州|阜阳|宿州|六安|亳州|池州|宣城"];
cityArray[14] = ["福建", "福州|厦门|莆田|三明|泉州|漳州|南平|龙岩|宁德"];
cityArray[15] = ["江西", "南昌|景德镇|九江|鹰潭|萍乡|新余|赣州|吉安|宜春|抚州|上饶"];
cityArray[16] = ["山东",
    "济南|青岛|淄博|枣庄|东营|烟台|潍坊|济宁|泰安|威海|日照|莱芜|临沂|德州|聊城|滨州|菏泽"];
cityArray[17] = ["河南",
    "郑州|开封|洛阳|平顶山|安阳|鹤壁|新乡|焦作|濮阳|许昌|漯河|三门峡|南阳|商丘|信阳|周口|驻马店|济源"];
cityArray[18] = ["湖北",
    "武汉|黄石|十堰|宜昌|襄阳|鄂州|荆门|孝感|荆州|黄冈|咸宁|随州|恩施土家族苗族自治州"];
cityArray[19] = ["湖南", "长沙|常德|株洲|湘潭|衡阳|岳阳|邵阳|益阳|娄底|怀化|郴州|永州|张家界|湘西土家族苗族自治州"];
cityArray[20] = ["广东",
    "广州|深圳|珠海|汕头|东莞|中山|佛山|韶关|江门|湛江|茂名|肇庆|惠州|梅州|汕尾|河源|阳江|清远|潮州|揭阳|云浮"];
cityArray[21] = ["广西",
    "南宁|柳州|桂林|梧州|北海|防城港|钦州|贵港|玉林|贺州|百色|河池|来宾|崇左"];
cityArray[22] = ["海南", "海口|三亚|三沙|儋州"];
cityArray[23] = ["四川",
    "成都|绵阳|德阳|泸州|自贡|遂宁|眉山|攀枝花|广元|内江|乐山|南充|宜宾|广安|达川|雅安|巴中|资阳|阿坝藏族羌族自治州|甘孜藏族自治州|凉山彝族自治州"];
cityArray[24] = ["贵州", "贵阳|六盘水|遵义|安顺|铜仁|毕节|黔西南布依族苗族自治州|黔东南苗族侗族自治州|黔南布依族苗族自治州"];
cityArray[25] = ["云南",
    "昆明|大理白族自治州|曲靖|玉溪|昭通|临沧|保山|丽江|楚雄彝族自治州|红河哈尼族彝族自治州|文山壮族苗族自治州|西双版纳傣族自治州|德宏傣族景颇族自治州|怒江傈僳族自治州|迪庆藏族自治州"];
cityArray[26] = ["西藏", "拉萨|日喀则|山南|林芝|昌都|阿里地区|那曲地区"];
cityArray[27] = ["陕西", "西安|宝鸡|咸阳|铜川|渭南|延安|榆林|汉中|安康|商洛|杨凌示范区"];
cityArray[28] = ["甘肃", "兰州|嘉峪关|金昌|白银|天水|酒泉|张掖|武威|定西|陇南|平凉|庆阳|临夏回族自治州|甘南藏族自治州"];
cityArray[29] = ["宁夏", "银川|石嘴山|吴忠|固原|中卫"];
cityArray[30] = ["青海", "西宁|海东|海南藏族自治州|海北藏族自治州|黄南藏族自治州|玉树藏族自治州|果洛藏族自治州|海西蒙古族藏族自治州"];
cityArray[31] = ["新疆",
    "乌鲁木齐|克拉玛依|吐鲁番|哈密|昌吉回族自治州|博尔塔拉蒙古自治州|阿克苏地区|喀什地区|和田地区|伊犁哈萨克自治州|克孜勒苏柯尔克孜自治州|巴音郭楞蒙古自治州"];
cityArray[32] = ["香港", "香港特别行政区"];
cityArray[33] = ["澳门", "澳门特别行政区"];
cityArray[34] = ["台湾",
    "台北|高雄|基隆|台中|台南|新竹|嘉义|桃园|新北"];
cityArray[35] = ["其它", "北美洲|南美洲|亚洲|非洲|欧洲|大洋洲"];

function getCity(currProvince) {
    //当前 所选择 的 省
    var currProvince = currProvince;
    var i, j, k;
    //清空 城市 下拉选单
    //document.all.selCity.length = 0;   火狐不支持这种写法
    document.getElementById("selCity").length=0;
    for (i = 0; i < cityArray.length; i++) {
        //得到 当前省 在 城市数组中的位置
        if (cityArray[i][0] == currProvince) {
            //得到 当前省 所辖制的 地市
            tmpcityArray = cityArray[i][1].split("|");;
            for (j = 0; j < tmpcityArray.length; j++) {
                //填充 城市 下拉选单
                document.getElementById("selCity").options[document.getElementById("selCity").length] = new Option(
                    tmpcityArray[j], tmpcityArray[j]);
            }
        }
    }
}

function getCityEx(currProvince) {
    //当前 所选择 的 省
    var currProvince = currProvince;
    var i, j, k;
    //清空 城市 下拉选单
    //document.all.selCity.length = 0;   火狐不支持这种写法
    document.getElementById("selCity").length=0;
    var result;
    for (i = 0; i < cityArray.length; i++) {
        //得到 当前省 在 城市数组中的位置
        if (cityArray[i][0] == currProvince) {
            //得到 当前省 所辖制的 地市
            tmpcityArray = cityArray[i][1].split("|");;
            result = tmpcityArray[0];
            //	alert('getCityEx'+result);
        }
    }

    return result;
}